//获取应用实例
const app = getApp();

Page({

  /**
   * 页面的初始数据
   */
  data: {
    question: [{ "title": "1、我很明了本测验的说明:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "2、我对本测验的每一个问题,都能做到诚实地回答:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "3、如果我有机会的话,*", "option": ["A)我愿意到一个繁华的城市去旅游;", "B)介于之间;", "C)我愿意游览清净的山区。"] }, { "title": "4、我有能力应付各种困难:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "5、即使是关在铁笼里的猛兽,我见了也会感到惴惴不安:*", "option": ["A)是的;", "B)不一定;", "C)不是的"] }, { "title": "6、我总是不敢大胆批评别人的言行:*", "option": ["A)是的;", "B)有时如此;", "C)不是的。"] }, { "title": "7、我的思想似乎:*", "option": ["A)比较先进;", "B)一般;", "C)比较保守。"] }, { "title": "8、我不擅长说笑话、讲有趣的故事:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "9、当我见到亲友或邻居争吵时:*", "option": ["A)我总是任其自己解决;", "B)介于之间;", "C)我总是予以劝解。"] }, { "title": "10、在群众集会上,我:*", "option": ["A)谈吐自如;", "B)介于之间;", "C)保持沉默。"] }, { "title": "11、我愿做一个:*", "option": ["A)建筑工程师;", "B)不确定;", "C)社会科学研究者。"] }, { "title": "12、阅读时:*", "option": ["A)我喜欢选读自然科学书籍;", "B)不确定;", "C)我喜欢选读政治理论书籍。"] }, { "title": "13、我认为很多人都有些心理不正常,只是他们不愿意承认:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "14、我希望我的爱人擅长交际,无须具有文艺才能:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "15、爱发脾气的人,我仍能以理相待:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "16、受人侍奉时,我常局促不安:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "17、在从事体力或脑力劳动之后,我总是需要比别人更多的休息时间,才能保持工作效率:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "18、半夜醒来,我常常因为不安而不能再入睡:*", "option": ["A)常常如此;", "B)有时如此;", "C)极少如此。"] }, { "title": "19、事情进行得不顺利时,我常常急得涕泪交流:*", "option": ["A)从不如此;", "B)有时如此;", "C)常常如此。"] }, { "title": "20、我认为只要双方同意离婚,就可以不受传统观念的束缚:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "21、我对人或物的兴趣都很容易改变:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "22、在工作中我愿意:*", "option": ["A)和别人合作;", "B)不确定;", "C)自己单独进行。"] }, { "title": "23、我常常会无缘无故地自言自语:*", "option": ["A)常常如此;", "B)偶然如此;", "C)从不如此。"] }, { "title": "24、无论是工作、饮食或外出旅游:*", "option": ["A)我总是匆匆忙忙,不能尽兴;", "B)介于之间;", "C)我总是从容不迫。"] }, { "title": "25、有时我怀疑别人是否对我的言行真正地有兴趣:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "26、如果我在厂里工作:*", "option": ["A)我愿做技术科的工作;", "B)不确定;", "C)我愿做宣传科的工作。"] }, { "title": "27、在阅读时:*", "option": ["A)我愿意读有关太空旅行的书籍;", "B)不太确定;", "C)我愿意读有关家庭的书籍。"] }, { "title": "28、本题后面列出的三个单词,哪个与其他两个单词不类同:*", "option": ["A)狗;", "B)石头;", "C)牛。"] }, { "title": "29、如果我能到一个新的环境,我要:*", "option": ["A)把生活安排得和从前不一样;", "B)不确定;", "C)和从前相仿。"] }, { "title": "30、在一生中,我总觉得我能达到我所预期的目标:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "31、当我说谎时,总觉得内心羞愧,不敢正视对方:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "32、假使我手里拿着一把装有子弹的手**,我必须把子弹取出来才能安心:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "33、多数人认为我是一个说话风趣的人:*", "option": ["A)是的;", "B)不确定;", "C)不是的。"] }, { "title": "34、如果人们知道我内心的成见,他们会大吃一惊:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "35、在公共场合,如果我突然成为大家注意的中心,就会感到局促不安:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "36、我总喜欢参加规模庞大的舞会:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "37、在学科中,我喜欢:*", "option": ["A)音乐;", "B)不确定;", "C)手工劳动。"] }, { "title": "38、我常常怀疑那些出乎我意料的对我过于友善的人的动机是否诚实:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "39、我愿意把我的生活:*", "option": ["A)安排得象一个艺术家;", "B)不确定;", "C)安排得象一个会计师。"] }, { "title": "40、我认为目前所需要的是:*", "option": ["A)多出一些改造世界的理想家;", "B)不确定;", "C)脚踏实地的实干家。"] }, { "title": "41、有时候我觉得我需要剧烈的体力劳动:*", "option": ["A)是的;", "B)介于(之间;", "C)不是的。"] }, { "title": "42、我愿意跟有教养的人来往而不愿意同鲁莽的人交往:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "43、在处理一些必须凭借智慧的事务中:*", "option": ["A)我的亲人比一般人差;", "B)普通;", "C)我的亲人表现得超人一等。"] }, { "title": "44、当领导召见我时,我:*", "option": ["A)觉得可以趁机提出建议;", "B)(B)介于之间;", "C)总怀疑自己做错了事。"] }, { "title": "45、如果待遇优厚,我愿意做护理精神病人的工作:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "46、读报时,我喜欢读:*", "option": ["A)当前世界上的基本问题;", "B)介于之间;", "C)地方新闻。"] }, { "title": "47、在接受困难任务时,我总是:*", "option": ["A)有独立完成的信心;", "B)不确定;", "C)希望别人的帮助和指导。"] }, { "title": "48、在游览时,我宁愿看一个画家的写生,也不愿听人家的辩论:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "49、我的神经脆弱,稍有点刺激就会使我战栗:*", "option": ["A)时常如此;", "B)有时如此;", "C)从不如此。"] }, { "title": "50、早晨起来,常常感到疲乏不堪:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "51、如果待遇相同:*", "option": ["A)我宁愿选做森林管理员;", "B)不一定;", "C)我愿意选做中小学教员。"] }, { "title": "52、每逢过年过节或亲友结婚时:*", "option": ["A)我喜欢赠送礼品;", "B)不太确定;", "C)我不愿相互送礼。"] }, { "title": "53、本题后面列有的三个数字中,哪个数字与其它的两个数字不同:*", "option": ["A)5;", "B)2;", "C)7。"] }, { "title": "54、猫和鱼就象:*", "option": ["A)牛和牛奶;", "B)牛和牧草;", "C)牛和盐。"] }, { "title": "55、我在小学时敬佩的老师,到现在仍然值得我敬佩:*", "option": ["A)是的", "B)不一定;", "C)不是的。"] }, { "title": "56、我觉得我确实有一些别人所不及的优良品质:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "57、根据我的能力,即使让我做一些平凡的工作,我也会安心的:*", "option": ["A)是的;", "B)不太确定;", "C)不是的。"] }, { "title": "58、我看电影或参加其他娱乐活动的次数:*", "option": ["A)比一般人多;", "B)和一般人相同;", "C)比一般人少。"] }, { "title": "59、我喜欢从事需要精密技术的工作:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "60、在有威望、有地位的人面前，我总是较为局促、谨慎:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "61、对于我来说在大众面前演讲或表演,是一件难事:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "62、我愿意:*", "option": ["A)指挥几个人工作;", "B)不确定;", "C)和同志们一起工作。"] }, { "title": "63、即使我做了一件让别人笑话的事,我也能坦然处之:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "64、我认为没有人会幸灾乐祸地希望我遭到困难:*", "option": ["A)是的;", "B)不确定;", "C)不是的。"] }, { "title": "65、一个人应该:*", "option": ["A)考虑人生的真正意义;", "B)不确定;", "C)踏踏实实的工作和学习。"] }, { "title": "66、我喜欢去处理被别人弄得一塌糊涂的工作:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "67、当我非常高兴时,总会产生一种“好景不长”的感觉:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "68、在一般困难的情景中,我总能保持乐观:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "69、迁居是一件极不愉快的事:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "70、在年轻的时候,当我和父母意见不同时:*", "option": ["A)保留自己的意见;", "B)介于之间;", "C)接受父母的意见。"] }, { "title": "71、我希望把我的家庭:*", "option": ["A)建设成适合自身活动和娱乐的地方;", "B)介于之间;", "C)成为邻里交往活动的一部分。"] }, { "title": "72、我解决问题时:*", "option": ["A)多借助于个人独立思考;", "B)介于之间;", "C)多借助于和别人互相讨论。"] }, { "title": "73、在需要当机立断时:*", "option": ["A)我总是镇静地运用理智;", "B)介于之间;", "C)我常常紧张兴奋。"] }, { "title": "74、最近在一两件事情上,我觉得我是无辜受累的:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "75、我善于控制我的表情:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "76、如果待遇相同,我愿做一个:*", "option": ["A)化学研究工作者;", "B)不确定;", "C)旅行社经理。"] }, { "title": "77、以“惊讶”与“新奇”搭配为列,我认为:*", "option": ["A)“惧怕”与勇敢搭配;", "B)“惧怕”与焦虑搭配;", "C)“惧怕”与恐怖搭配。"] }, { "title": "78、本题后面列出的三个分数,哪一个分数与其它两个分数不类同:*", "option": ["A)3/7;", "B)3/9;", "C)3/11。"] }, { "title": "79、不知为什么,有些人总是回避或冷淡我:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "80、我虽然好意待人,却常常得不到好报:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "81、我不喜欢争强好胜的人:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "82、和一般人相比,我的朋友的确太少:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "83、不在万不得已的情况下,我总是回避参加应酬性的活动:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "84、我认为对领导逢迎得当,比工作表现更重要:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "85、参加竞赛时,我总是着重在竞赛中活动,而不计较其成败:*", "option": ["A)总是如此;", "B)一般如此;", "C)偶然如此。"] }, { "title": "86、按照我个人的意愿,我希望做的工作是:*", "option": ["A)有固定而可靠的工资收入;", "B)介于之间;", "C)工资高低应随我的工作表现而随时调整。"] }, { "title": "87、我愿意阅读:*", "option": ["A)军事与政治的实事记载;", "B)不确定;", "C)富有情感和幻想的作品。"] }, { "title": "88、我认为有许多人之所以不敢犯罪,其主要原因是怕被惩罚:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "89、我的父母从来不严格要求我事事顺从:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "90、“百折不挠,再接再励”的精神似乎被人们所忽略:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "91、当有人对我发火时,我总是:*", "option": ["A)设法使他镇静下来;", "B)不太确定;", "C)自己也会发起火来。"] }, { "title": "92、我希望:*", "option": ["A)人们都要友好相处;", "B)不一定;", "C)开展斗争。"] }, { "title": "93、不论是在极高的屋顶上,还是极深的隧道中,我很少感到胆怯不安:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "94、只要没有过错,不管别人怎么说,我总能心安理得:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "95、我认为凡是无法用理智来解决的问题,有时就不得不靠集权处理:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "96、我在年轻的时候,和异性朋友交往:*", "option": ["A)较多;", "B)介于之间;", "C)较别人少。"] }, { "title": "97、我在社团活动中,是一个活跃分子:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "98、在人声噪杂中,我仍能不受干扰,专心工作:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "99、在某些心境下,我常常因为困惑陷入空想而将工作搁下来:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "100、我很少用难堪的语言去刺伤别人的感情:*", "option": ["A)是的;", "B)不太确定;", "C)不是的。"] }, { "title": "101、如果让我选择,我宁愿选做:*", "option": ["A)列车员;", "B)不确定;", "C)描图员。"] }, { "title": "102、“理不胜词”的意思是:*", "option": ["A)理不如词;", "B)理多而词少;", "C)词藻华丽而理不足。"] }, { "title": "103、以“铁锹”与“挖掘”搭配为例,我认为:*", "option": ["A)刀子与琢磨搭配;", "B)刀子与切割搭配;", "C)刀子与铲除搭配。"] }, { "title": "104、我在大街上,常常避开我所不愿意打招呼的人:*", "option": ["A)极少如此;", "B)偶然如此;", "C)有时如此。"] }, { "title": "105、当我聚精会神地听音乐时,假使有人在旁边高谈阔论:*", "option": ["A)我仍能专心听音乐;", "B)介于之间;", "C)不能专心而感到恼怒。"] }, { "title": "106、在课堂上,如果我的意见与老师不同,我常常:*", "option": ["A)保持沉默;", "B)不一定;", "C)当场表明自己的看法。"] }, { "title": "107、我单独跟异性谈话时,总显得不自然:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "108、我在待人接物方面,的确不太成功:*", "option": ["A)是的;", "B)不完全这样;", "C)不是的。"] }, { "title": "109、每当做一件困难工作时,我总是:*", "option": ["A)预先做好准备;", "B)介于之间;", "C)相信到时候总会有办法解决的。"] }, { "title": "110、在我结交的朋友方面,男女各占一半:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "111、我在结交朋友方面:*", "option": ["A)结实很多的人;", "B)不一定;", "C)维持几个深交的朋友。"] }, { "title": "112、我愿意做一个社会科学家而不愿做一个机械工程师:*", "option": ["A)是的;", "B)不确定;", "C)不是的。"] }, { "title": "113、如果我发现了别人的缺点,我就不计一切地提出指责:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "114、我喜欢设法影响和我一起工作的同志,使他们能够协助我实现我所计划的目标:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "115、我喜欢做戏剧、音乐、歌舞、新闻等采访工作:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "116、当人们表扬我的时候,我总觉得羞愧窘促:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "117、我认为一个国家最需要解决的问题是:*", "option": ["A)政治问题;", "B)不太确定;", "C)道德问题。"] }, { "title": "118、有时我会无故地产生一种面临大祸的恐惧：*", "option": ["A)是的；", "B)有时如此；", "C)不是的。"] }, { "title": "119、我在童年时，害怕黑暗的次数：*", "option": ["A)极多；", "B)不太多；", "C)几乎没有。"] }, { "title": "120、在闲暇的时候，我喜欢：*", "option": ["A)看一部历史性的探险电影；", "B)不一定；", "C)读一本科学性的幻想小说。"] }, { "title": "121、当人们批评我古怪不正常时，我：*", "option": ["A)非常气恼；", "B)有些生气；", "C)无所谓。"] }, { "title": "122、到一个新城市里去找地点:*", "option": ["A)找人问路;", "B)介于之间;", "C)参考市区地图。"] }, { "title": "123、当朋友声明他要在家休息时,我总是设法怂恿他同我一起到外面去游览:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "124、在就寝时:*", "option": ["A)我常常不易入睡;", "B)介于之间;", "C)我常常极易入睡。"] }, { "title": "125、有人烦扰我时:*", "option": ["A)我能不露声色;", "B)介于之间;", "C)我总要说给别人听,以泄气愤。"] }, { "title": "126、如果待遇相同:*", "option": ["A)我愿做一个律师;", "B)不确定;", "C)我愿做一个航海员。"] }, { "title": "127、“时间改变了永恒”这是比喻:*", "option": ["A)时间过得很快;", "B)忘了时间;", "C)光阴一去不复返。"] }, { "title": "128、本题后面列的哪一项应接在“X0000XX000XXX”的后面:*", "option": ["A)X0X;", "B)00X;", "C)0XX。"] }, { "title": "129、我不论到什么地方,都能清楚地辨别方向:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "130、我热爱我所学的专业和所从事的工作:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "131、如果我急于想借朋友的东西,而朋友又不在家时,我认为不告而取也没有关系:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "132、我喜欢向朋友讲述一些我个人有趣的经历:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "133、我宁愿做一个:*", "option": ["A)演员;", "B)不确定;", "C)建筑师。"] }, { "title": "134、业余时间,我总是做好安排,不使时间浪费:*", "option": ["A)是的;", "B)介于)之间;", "C)不是的。"] }, { "title": "135、在和别人交往中,我常常会无缘无故地产生一种自卑感:*", "option": ["A)是的;", "B)介于)之间;", "C)不是的。"] }, { "title": "136、和不熟悉的人交谈,对我来说:*", "option": ["A)毫不困难;", "B)介于之间;", "C)是一件难事。"] }, { "title": "137、我所喜欢的音乐是:*", "option": ["A)轻松活泼的;", "B)介于之间;", "C)富于感情的。"] }, { "title": "138、我爱想入非非:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "139、我认为未来二十年的世界局势定将转好:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "140、在童年时我喜欢阅读:*", "option": ["A)神话幻想故事;", "B)不确定;", "C)战争故事。"] }, { "title": "141、我向来对机械、汽车等会发生兴趣:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "142、即使让我做一个缓刑释放的罪犯的管理员,我也会把工作搞得较好:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "143、我仅仅被认为是一个能够苦干而稍有成就的人而已:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "144、就是在不顺利的情况下,我仍能保持精神振奋:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "145、我认为节制生育是解决经济与和平问题的重要条件:*", "option": ["A)是的;", "B)不太确定;", "C)不是的。"] }, { "title": "146、在工作中,我喜欢独自筹划,不愿受别人干涉:*", "option": ["A)是的;", "B)不太确定;", "C)不是的。"] }, { "title": "147、尽管有的同志和我的意见不和,但我仍能跟他搞好团结:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "148、我在工作和学习上,总是使自己不粗心大意、忽略细节:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "149、在和人争辩或险遭事故后,我常常表现出震颤、精疲力尽、不能安心工作:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "150、未经医生处方,我是从不乱吃药的:*", "option": ["A)是的;", "B)介于之;", "C)不是的。"] }, { "title": "151、根据我个人的兴趣,我愿意参加:*", "option": ["A)摄影组活动;", "B)不确定;", "C)文娱队活动。"] }, { "title": "152、以星火燎原搭配为例,我认为:*", "option": ["A)姑息,同情;", "B)姑息,养奸;", "C)姑息,纵容。"] }, { "title": "153、“钟表”与“时间”的关系犹如:*", "option": ["A)“裁缝”与服装;", "B)“裁缝”与剪刀;", "C)“裁缝”与布料。"] }, { "title": "154、生动的梦境,常常干扰我的睡眠:*", "option": ["A)经常如此;", "B)偶然如此;", "C)从不如此。"] }, { "title": "155、我爱打抱不平:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "156、如果我要到一个新城市:*", "option": ["A)我将要到处闲逛;", "B)不确定;", "C)不是的。"] }, { "title": "157、我爱穿朴素的衣裳,不愿穿华丽的衣服:*", "option": ["A)是的;", "B)不太确定;", "C)不是的。"] }, { "title": "158、我认为安静的娱乐远远胜过热闹的宴会:*", "option": ["A)是的;", "B)不太确定;", "C)不是的。"] }, { "title": "159、我明知自己有缺点,但不愿接受别人的批评:*", "option": ["A)偶然如此;", "B)极少如此;", "C)从不如此。"] }, { "title": "160、我总是把“是,非,善,恶”作为处理问题的原则:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "161、当我工作时,我不喜欢有许多人在旁边参观:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "162、我认为,侮辱那些即使有错误的有文化教养的人,如医生,教师等,也是不应该的:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "163、在各种课程中:*", "option": ["A)我喜欢语文;", "B)不确定;", "C)我喜欢数学。"] }, { "title": "164、那些自以为是,道貌岸然的人使我生气:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "165、和循规蹈矩的人交谈:*", "option": ["A)很有兴趣,并有所得;", "B)介于之间;", "C)他们的思想简单,使我厌烦。"] }, { "title": "166、我喜欢:*", "option": ["A)有几个有时对我很苛求但富有感情的朋友;", "B)介于之间;", "C)不受别人的干涉。"] }, { "title": "167、如果征求我的意见,我赞同:*", "option": ["A)切实制止精神病患者和智能低的人生育;", "B)不确定:", "C)杀人犯必须判处死刑。"] }, { "title": "168、有时我会无缘无故地感到沮丧、痛苦:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "169、当和立场相反的人争辩时:*", "option": ["A)我主张尽量找出基本概念的差异;", "B)不一定;", "C)我主张彼此让步。"] }, { "title": "170、我一向是重感情而不重理智,因此我的观点常常动摇不定:*", "option": ["A)是的;", "B)大致如此;", "C)不是的。"] }, { "title": "171、我的学习多赖于:*", "option": ["A)阅读书刊;", "B)介于之间;", "C)参加集体讨论。"] }, { "title": "172、我宁愿选择一个工资较高的工作,不在乎是否有保障,而不愿做工资低的固定工作:*", "option": ["A)是的;", "B)不太确定;", "C)不是的。"] }, { "title": "173、在参加讨论时,我总是能把握住自己的立场:*", "option": ["A)经常如此;", "B)一般如此;", "C)必要时才能如此。"] }, { "title": "174、我常常被一些无所谓的小事所烦扰:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "176、下列工作如果任我挑选的话,我愿做:*", "option": ["A)少先队辅导员;", "B)不太确定;", "C)修表工作。"] }, { "title": "177、一人___事,众人受累:*", "option": ["A)偾;", "B)愤;", "C)喷。"] }, { "title": "178、望子成龙的家长往往___苗助长:*", "option": ["A)揠;", "B)堰;", "C)偃。"] }, { "title": "179、气候的变化并不影响我的情绪:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "180、因为我对一切问题都有一些见解,所以大家都认为我是一个有头脑的人:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "181、我讲话的声音:*", "option": ["A)响亮;", "B)介于之间;", "C)低沉。"] }, { "title": "182、一般人都认为我是一个活跃热情的人:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "183、我喜欢做出差机会较多的工作:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "184、我做事严格,力求把事情办得尽善尽美:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "185、在取回或归还借的东西时,我总是仔细检查,看是否保持原样:*", "option": ["A)是的;", "B)介于之间;", "C)不是的。"] }, { "title": "186、我通常总是精力充沛,忙碌多事:*", "option": ["A)是的;", "B)不一定;", "C)不是的。"] }, { "title": "187、我确信我没有遗漏或不精心回答上面的任何问题:*", "option": ["A)是的;", "B)不确定;", "C)不是的。"] }],
    answer:[],
    bgColor:'red',
    pageIndex:0
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    //获取当前页面是否传参过来继续游戏
    let questionIndex = options.questionIndex; 
    console.log(questionIndex);
    console.log(this.data.question.length, this.data.answer.length)
    let temporaryStorage = wx.getStorageSync('temporaryStorage');
    if (temporaryStorage instanceof Array && temporaryStorage.length > 0 && questionIndex){
      this.setData({
        pageIndex: questionIndex,
        answer: temporaryStorage
      });
      
      if (this.data.answer.length == this.data.question.length) {
        wx.navigateTo({
          url: `../analyze/index`
        })
      }
    }
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
    
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
    
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
    
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
    
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
    
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    
  },
  backQuestion: function (e) {
    //返回上一题
    this.setData({
      bgColor: app.randomColor(),
      pageIndex: this.data.pageIndex - 1
    })
    console.log(this.data.pageIndex)
    
  },
  select: function (e){
    console.log(e.currentTarget.dataset.id);
    console.log(e.currentTarget.dataset.index);
    var newanswer = this.data.answer;
    newanswer.splice(e.currentTarget.dataset.index, 1, e.currentTarget.dataset.id);
    this.setData({
      bgColor: app.randomColor(),
      answer: newanswer,
      pageIndex: e.currentTarget.dataset.index+1
    })
    console.log(this.data.answer)
    this.temporaryStorage(this.data.answer);
    //临时跳转
    if (this.data.answer.length == this.data.question.length){
      wx.navigateTo({
        url: `../analyze/index`
      })
    }
  },
  temporaryStorage:function(data) {
    wx.setStorageSync('temporaryStorage', data)
  }
})