Page({

  /**
   * 页面的初始数据
   */
  data: {
    trait:{
      a: {
        title:'乐群性',
        brief:'表示热情对待他人的水平',
        score:0,
        questionNum: [3,26,27,51,52,76,101,126,151,176],
        level:{
          1:[0,1],
          2:[2,3],
          3:[4,5],
          4:[6],
          5:[7,8],
          6:[9,11],
          7:[12,13],
          8:[14],
          9:[15,16],
          10:[17,20]
        },
        lowText:'对人冷漠，落落寡合，喜欢吹毛求疵，宁愿独自工作，对事而不对人，不轻易放弃自己的主见，为人做事的标准常常很高。严谨而不苟且。（物理学家、电机工程师)',
        middleText: '既不是很孤独、冷漠，也不是很外向，热情.教师和推销员多系高A，而物理学家和电机工程师则多系低A。前者需要时时应付人与人之间的复杂情绪或行为问题漏填，而仍然能够保证其乐观的态度。后者则必须极端的冷静严肃与正确才能圆满地完成任务。',
        highText: '外向、热情、乐群。和蔼可亲，合作与适应能力强，喜欢和别人共同工作，喜欢参加组织各种社团活动，不斤斤计较，容易接受别人的批评，萍水相逢也可以一见如故。（教师，推销员）'
      },
      b: {
        title: '聪慧性',
        brief: '刺激寻求与表达的自发性',        
        score: 0,
        questionNum: [28,53,54,77,78,102,103,127,128,152,153,177,178],
        level: {
          1: [0, 3],
          2: [4],
          3: [5],
          4: [6],
          5: [7],
          6: [8],
          7: [9],
          8: [10],
          9: [11],
          10: [12,13]
        },
        lowText: '思维迟钝、理解能力弱，不能举一反三。情绪不稳定心理易失常。',
        middleText: '表达的自然流露程度和多数人一样，在进行决策时，会进行认真思考。',
        highText: '聪明、善于抽象思考。学习能力强，思维敏捷个人身心状况健康（不喜欢做打字员、电话接线、家庭主妇等不费脑的工作）'
      },
      c: {
        title: '稳定性',
        brief: '对日常生活要求应付水平的知觉',                
        score: 0,
        questionNum: [4,5,29,30,55,79,80,104,105,129,130,154,179],
        level: {
          1: [0, 5],
          2: [6,7],
          3: [8,9],
          4: [10,11],
          5: [12,13],
          6: [14,16],
          7: [17,18],
          8: [19,20],
          9: [21,22],
          10: [23,26]
        },
        lowText: '低分者通常表现为：不能以“逆来顺受”的态度，应付生活上所遭遇的阻扰和挫折，容易受环境的支配，而心神动摇不定。不能面对现实，时时会暴躁不安，心身疲乏，甚至于失眠，噩梦，恐怖等症象。所有神经病人和精神病人都属低。（作家，邮差或清道工）',
        middleText: ':既不情绪激动，也不是很稳定而成熟教师，机器工程师，推销员，救火队队员等，凡需要应付日常生活各种难题者应有高C。但是凡能随心所欲，安排自己工作进度的人，如作家，邮差或清道工等，则虽系低C，尚无大碍。',
        highText: ' 高分者通常表现为：以沉着的态度应付现实各项问题。行动充满魄力。能振奋勇气，维持团队的精神。有时高C也可能由于不能彻底解决许多生活难题，而不得不自我宽解。（教师，机器工程师，推销员，救火队队员）'
      },
      e: {
        title: '恃强性',
        brief: '力图影响他人的倾向性水平',  
        score: 0,
        questionNum: [6,7,31,32,56,57,81,106,131,155,156,180,181],
        level: {
          1: [0, 2],
          2: [3, 4],
          3: [5],
          4: [6,7],
          5:[8,9],
          6:[10,12],
          7:[13,14],
          8: [15, 16],
          9: [17, 18],          
          10: [19, 26]
        },
        lowText: '行为温顺，迎合别人的意旨，也可能因为希望可遇而不可求，即使处在十全十美的境地，而有“事事不如人”之感，许多精神病人都有这样消极的心情。',
        middleText: ':既不谦逊、顺从、也不是很好强固执，自以为是。一般的，领袖以及有地位有成就的人多属高E。救火队员和航空飞行员的因素E高。男人较女人高。',
        highText: '自视甚高，自以为是。可能非常地武断，而时常驾驭不及他的人和反抗权势者。一般的，领袖以及有地位有成就的人多属高E'
      },
      f: {
        title: '兴奋性',
        brief: '寻求娱乐的倾向和表达的自发性水平',          
        score: 0,
        questionNum: [8,33,58,82,83,107,108,132,133,157,158,182,183],
        level: {
          1: [0, 3],
          2: [4],
          3: [5,6],
          4: [7],
          5: [8, 9],
          6: [10, 12],
          7: [13, 14],
          8: [15, 16],
          9: [17, 18],
          10: [19, 26]
        },
        lowText:'行动拘禁，内省而不轻易发言，较消极，忧郁。有时候可能过分深思熟虑，又近乎骄傲自满。在职责上，他常是认真而可靠的工作人员。(实验技术人员)',
        middleText: '不是很严肃、谨慎、冷静、寡言、行动拘禁，也不是很活泼，愉快，健谈行政主管人员多有高F。竞选人必有高F, 才能够获得选民的爱戴，实验技术人员则不必有高F。',
        highText:'活泼，愉快，健谈，对人对事热心而富有感情。但是有时也可能会冲动，以致行为变化莫测。(政主管人员)'
      },
      g: {
        title: '有恒性',
        brief:'崇尚并遵从行为的社会化标准和外在强制性规则',
        score: 0,
        questionNum: [9,34,59,84,109,134,159,160,184,185],
        level: {
          1: [0, 5],
          2: [6,7],
          3: [8, 9],
          4: [10],
          5: [11, 12],
          6: [13, 14],
          7: [15, 16],
          8: [17],
          9: [18],
          10: [19, 20]
        },
        lowText:'缺乏较高的目标和理想，对于人群及社会没有绝对的责任感，甚至于有时不惜执法犯法，不择手段已达到某一目的。但他常能有效的解决实际问题，而无须浪费时间和精力。',
        middleText:'既不苟且敷衍、缺乏奉公守法的精神，也不是很持恒负责、做事尽职。各种社团组织的领袖需要高G。业务管理和警察具有极高的因素G。任性纵欲，放火杀人的罪犯，因素G 极低。',
        highText:'细心周到，有始有终。是非善恶是他的行为指针。所结交的朋友多是努力苦干的人，而不十分欣赏诙谐有趣的人。(各种社团组织的领袖,业务管理,警察)'
      },
      h: {
        title: '敢为性',
        brief:'在社会情境中感觉轻松的程度',
        score: 0,
        questionNum: [10,35,36,60,61,85,86,110,111,135,136,161,186],
        level: {
          1: [0, 1],
          2: [2],
          3: [3],
          4: [4,6],
          5: [7,8],
          6: [9, 11],
          7: [12, 14],
          8: [15,16],
          9: [17,19],
          10: [20, 26]
        },
        lowText: '在人群中羞怯。有不自然的姿态，有强烈的自卑感。拙于发言，更不愿和陌生人交谈。凡是采取观望的态度，有时由于过分的自我意识而忽视了社会环境中的重要事物与活动。',
        middleText:'既不畏怯退缩、缺乏自信心、也不是很冒险敢为、少有顾忌。因素H常随年龄而增强。救火队队员和飞行员有高H，事物员多是低H。团队领导人必具有高H。',
        highText:'不掩饰，不畏缩，有敢做敢为的精神，使他能经历艰辛而保持刚毅的一例。有时可能太粗心大意，忽视细节，遭受无谓的打击与挫折。可能无聊多事，喜欢向异性殷勤卖力。'
      },
      i: {
        title: '敏感性',
        brief:'个体的主观情感影响对事物判断的程度',
        score: 0,
        questionNum: [11,12,37,62,87,112,137,138,162,163],
        level: {
          1: [0, 5],
          2: [6],
          3: [7, 8],
          4: [9],
          5: [10, 11],
          6: [12, 13],
          7: [14],
          8: [15,16],
          9: [17],
          10: [18, 19]
        },
        lowText:'在进行判断和决策时，倾向于注重逻辑性和客观性。(工程师，外科医生，统计师)',
        middleText: '在需要判断和决策时，倾向于注意事实以及他们的实用意义，同时也意识到有关问题的情绪性后果和价值。实际上，判断事实倾向于在主观与客观之间取平衡。室内设计师，音乐家，艺人，女人属高I，而工程师，外科医生，统计师等则多低I.8）',
        highText:'对事物的判断较容易受自己的情感和价值观影响。对某个决策的判断更多地基于它看起来是否正确，而不是对它进行冷静的逻辑分析。因此，在对事物进行评价时，更关注自己的品位、价值观和感觉。敏感，感情用事的一类，具体表现为：通常心肠软，易受感动，较女性化，爱好艺术，富于幻想。有时过分不切实际，缺乏耐心和恒心，不喜欢接近粗俗的人和做笨重的工作。在团体活动中，不着实际的看法与行为常常减低了团队的工作效率。(室内设计师，音乐家，艺人)'
      },
      l: {
        title: '怀疑性',
        brief:'喜欢探究他人表面言行举止之后的动机倾向',
        score: 0,
        questionNum: [13,38,63,64,88,89,113,114,139,164],
        level: {
          1: [0, 3],
          2: [4,5],
          3: [6],
          4: [7,8],
          5: [9,10],
          6: [11, 12],
          7: [13],
          8: [14, 15],
          9: [16],
          10: [17, 20]
        },
        lowText:'无猜忌，不与人角逐竞争，顺应合作，善于体贴人。(工程师，机工，精神病护理员)',
        middleText:'既不信赖随和、易与人相处，也不是很怀疑、刚愎、固执己见   在团体活动中，低L是以团体福利为前提的忠实分子，因素L过分高者常常成事不足，败事有余。工程师，机工，精神病护理员多是低L，而行政人员和警察常是高L',
        highText:'怀疑，不信任别人，与人相处，常常斤斤计较，不顾及到别人的利益。(行政人员,警察)'
      },
      m: {
        title: '幻想性',
        brief:'个体在关注外在环境因素与关注内在思维过程两者之间寻求平衡的水平。',
        score: 0,
        questionNum: [14,15,39,40,65,90,91,115,116, 140,141,165,166],
        level: {
          1: [0, 5],
          2: [6, 7],
          3: [8,9],
          4: [10, 11],
          5: [12, 13],
          6: [14, 15],
          7: [16,17],
          8: [18, 19],
          9: [20],
          10: [21, 26]
        },
        lowText:'先要斟酌现实条件，而后决定取舍，不鲁莽从事。在紧要关头时，也能保持镇静，有时可能过分重视现实，为人索然寡趣。',
        middleText:'既不是很现实、合乎成规、力求妥善合力，也不是很喜欢幻想、狂放不羁艺术家，作者及从事研究者多有高M。低M多选择需要实际，机警，脚踏实地的工作。',
        highText:'忽视生活的细节，只以本身的动机，当时兴趣等主观因素为行为的出发点。可能富有创造力，有时也过分不务实际，近乎冲动。因而容易被人误解及奚落。(艺术家，作者及从事研究者)'
      },
      n: {
        title: '世故性',
        brief:'个人信息私人化的倾向',
        score: 0,
        questionNum: [16,17,41,42,66,67,92,117,142,167],
        level: {
          1: [0, 2],
          2: [3],
          3: [4],
          4: [5, 6],
          5: [7, 8],
          6: [9, 10],
          7: [11],
          8: [12, 13],
          9: [14],
          10: [15, 20]
        },
        lowText:'思想简单，感情用事。与人无争，与世无杵，自许，心满意足。但有时显得幼稚，粗鲁，笨拙，似乎缺乏教养，低N使他不苛求责难，能容忍同情信徒的缺点。（，牧师神父，护士）',
        middleText: '既不是很坦白、直率、天真，也不是很精明能干、世故。科学家，工程师，飞行员多是高N，牧师神父，护士等多是低N，牧师的因素N不应太高，低N使他不苛求责难，能容忍同情信徒的缺点。',
        highText:'处事老练，行为得体。能冷静地分析一切，近乎狡猾。对于一切事物的看法是理智的，客观的。（科学家，工程师，飞行员）'
      },
      o: {
        title: '忧虑性',
        brief:'自我批判的程度',
        score: 0,
        questionNum: [18,19,43,44,68,69,93,94,11,119,143,144,168],
        level: {
          1: [0, 2],
          2: [3,4],
          3: [4],
          4: [5, 6],
          5: [7, 8],
          6: [9, 10],
          7: [11],
          8: [12, 13],
          9: [14],
          10: [15, 20]
        },
        lowText:'有信心，不轻易动摇，信任自己有应付问题的能力，有安全感，能适应世俗。有时因为缺乏同情，而引发别人的反感与恶意。(运动员，电机工，救火队员，护士)',
        middleText: '既不是很乐群、沉着、有自信心，也不是很忧虑抑郁、烦恼自扰年老的女招待，低级办事员，以及终生碌碌未尽如意的作家，编辑人等有高O。职业运动员，电机工，救火队员，护士等多是低O。',
        highText:'觉得世道艰辛，人生不如意事常八九，甚至沮丧悲观，时时有患得患失之感。自觉不容于人，也缺乏和人接近的勇气。各种神经病和精神病人都有高O。(作家，编辑)'
      },
      p1: {
        title: '实验性',
        brief:'对新观念与经验的开放性',
        score: 0,
        questionNum: [20,21,45,46,70,95,120,145,169,170],
        level: {
          1: [0, 4],
          2: [5],
          3: [6,7],
          4: [8],
          5: [9,10],
          6: [11, 12],
          7: [13],
          8: [14],
          9: [15],
          10: [16, 20]
        },
        lowText:'无条件地接受社会中许多相沿已久而有权威性的见解，不愿常是探求新的境界。常常激烈的反对新思想以及一切新的变动。在政治与宗教信仰上，墨守成规，可能被称为老顽固或时代的落伍者。(护士，牧师神父)',
        middleText:'喜欢考验一切现有的理论与实施，而予以新的评价，不轻易判断是非，企图了解较前卫的思想与行为。可能广见多闻。愿意充实自己的生活经验。(政治家，科学家)',
        highText:'既不是很保守的、尊重传统观念与行为标准，也不是很喜欢自由、批评激进、不拘泥现实行政主管人，前卫的政治家，科学家都必须具有高Q1，护士，牧师神父与许多为首高深教育的技工等则多有低Q1，神经病人的因素Q1也比较低。'
      },
      p2: {
        title: '独立性',
        brief:'融合于周围群体几及参与集体活动的倾向性',
        score: 0,
        questionNum: [22,47,71,72,96,97,121,122,146,171],
        level: {
          1: [0, 5],
          2: [6,7],
          3: [8],
          4: [9,10],
          5: [11, 12],
          6: [13, 14],
          7: [15],
          8: [16,17],
          9: [18],
          10: [19, 20]
        },
        lowText:'宁欲与人共同工作，而不愿独立孤行。常常放弃个人的主见而附和取得别人的好感，需要团体的支持以维持其自信心，却并非真正的乐群者。',
        middleText:'既不是很依赖、随群附和，也不是很自立自强、当机立断科学家，行政主管人等多有高Q2，低Q2者不能胜任需要随机应变能力的职务。',
        highText:'能够自作主张，独自完成自己的工作计划，不依赖别人，也不受社会舆论的约束，同样也无意控制或支配别人，不嫌恶人，但是也不需要别人的好感。'
      },
      p3: {
        title: '自律性',
        brief:'认为以清晰的个人标准及良好的组织性对行为进行规划的重要性程度',
        score: 0,
        questionNum: [23,24,48,73,98,123,147,148,172,173],
        level: {
          1: [0, 4],
          2: [5, 6],
          3: [7,8],
          4: [9, 10],
          5: [11, 12],
          6: [13, 14],
          7: [15],
          8: [16, 17],
          9: [18],
          10: [19, 20]
        },
        lowText:'既不能克制自己，又不能尊重礼俗，更不愿考虑别人的需要，充满矛盾却无法解决。生活适应有问题者多低Q3.',
        middleText:'既不矛盾冲突、不能克制自己，也不是很知己知彼、自律谨严高Q3者多具有领袖能力的才干，主管人，电机工和生产部门的成功也需要高Q3。',
        highText:'言行一致，能够合理的支配自己的感情行动。为人处世，总能保持其自尊心，赢得别人的尊重，有时却不免太固执己见。'
      },
      p4: {
        title: '紧张性',
        brief:'在和他人的交往中的不稳定性、不耐心以及由此所表现的躯体紧张水平。',
        score: 0,
        questionNum: [25,49,50,74,75,99,100,124,125,149,150,174,175],
        level: {
          1: [0, 2],
          2: [3, 4],
          3: [5, 6],
          4: [7, 8],
          5: [9, 11],
          6: [12, 14],
          7: [15,16],
          8: [17, 19],
          9: [20,21],
          10: [22, 26]
        },
        lowText:'知足常乐，保持内心的平衡。也可能过分疏懒，缺乏进取心。',
        middleText:'既不是很心平气和、闲散宁静，也不是很紧张闲扰、激动挣扎未能在生活或职业中发挥本身才智潜能的人多具有高Q4，如餐店招待，家庭主妇，缺乏生活保障的作业等。',
        highText:'缺乏耐心，心神不安，态度兴奋。时常感觉疲乏，又无法彻底摆脱以求宁静。在社群中，他对人与事都缺乏信心。每日生活战战兢兢，而不能自给。'
      },
    },
    //下列题凡是选以下对应的选项加1分，否则加0分。其余选B均加1分，选以下对应的选项加2分，否则加0分，第1、2、187题不计分；
    specialNum: {
      28: 1,
      53: 1,
      54: 1,
      77: 2,
      78: 1,
      102: 2,
      103: 1,
      127: 2,
      128: 1,
      152: 1,
      153: 2,
      177: 0,
      178: 0
    },
   //加二分
    doubleNum:{
      3:0, 4:0,5:2 ,6:2,7:0,8:2,9:2,10:0,11:2,12:2,13:0,14:2,15:2,16:2,17:0,18:0,19:2, 20:0 , 21:0 , 22:2 ,23:2,24:2,25:0,26:2 ,27:2, 29:2, 30:2,31:2, 32:2,33:0,

34:2,   35:2,   36:0,   37:0,   38:0,   39:0,   40:0,    41:2,   42:0,    43:0,

44:2,   45:2,   46:0,   47:0,   48:0,   49:0,   50:0,    51:2,   52:0,    55:0,

56:0,   57:2,   58:0,   59:2,   60:2,   61:2,   62:2,    63:2,   64:2,    65:0,

66:2,   67:2,   68:2,   69:2,   70:0,   71:0,   72:0,    73:0,   74:0,    75:2,

76:2,   79:2,   80:2,   81:2,   82:2,   83:2,   84:2,    85:2,   86:2,    87:2,

88:0,   89:2,   90:2,   91:0,   92:2,   93:2,   94:2,    95:2,   96:2,    97:2,

98:0,   99:0,   100:2, 101:0, 104:0, 105:0, 106:2,   107:2, 108:2,   109:0,

110:0, 111:0, 112:0, 113:0, 114:0,   115:0, 116:0,   117:0, 118:0,   119:0,

120:2, 121:2, 122:2, 123:2, 124:0, 125:2, 126:0,   129:0, 130:0,   131:0,

132:0, 133:0, 134:0, 135:2, 136:0, 137:2, 138:0,   139:2, 140:0,   141:2,

142:0, 143:0, 144:2, 145:0, 146:0, 147:0, 148:0,   149:0, 150:0,   151:2,

154:2, 155:0, 156:0, 157:2, 158:2, 159:2, 160:0,   161:2, 162:2,   163:0,

164:0, 165:2, 166:2, 167:0, 168:0, 169:0, 170:2,   171:0, 172:2,   173:0,

174:0, 175:2, 176:0, 179:0, 180:0, 181:0, 182:0,   183:0, 184:0,   185:0,
186:0
    }
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    let temporaryStorage = wx.getStorageSync('temporaryStorage');
    if (temporaryStorage){
      var specialNum = this.data.specialNum;
      var specialNumKey = Object.keys(this.data.specialNum);
      for (var i = 0; i<temporaryStorage.length;i++){
        let el = temporaryStorage[i];
        var queryNum = i + 1;
        //下列题凡是选以下对应的选项加1分，否则加0分，第1、2、187题不计分；
        if (specialNumKey.includes(`${queryNum}`) && el == specialNum[queryNum]){
          //在特殊得分项中
          // console.log(queryNum)
          this.addScore(queryNum,1);
          // console.log(i)
        }else{
          //不在特殊选项里面
          //下列每题凡是选B均加1分，选以下对应的选项加2分，否则加0分。，第1、2、187题不计分
          if (queryNum == 1 || queryNum == 2 || queryNum ==187 ){
              continue;
          }
          if (el == 1 && !specialNumKey.includes(`${queryNum}`)){
            this.addScore(queryNum,1);
          }
          
          if (!specialNumKey.includes(`${queryNum}`)){
            //加2分
            var doubleNum = this.data.doubleNum;
            for (var y in doubleNum){
              if(y == i && doubleNum[y] == el){
                this.addScore(queryNum, 2);
                continue;
              }
            }
          }
        }
      }
      
      for (var y in this.data.trait){
        var score = this.data.trait[y].score;
        var level = this.data.trait[y].level;
        var standardScore = `trait.${y}.standardScore`;
        var levelCN = `trait.${y}.levelCN`;
        for (var r in level){
          if (score == level[r] && level[r].length == 1){
            this.setData({
              [standardScore]: r,
              [levelCN]: r <= 3 ? '低' : r >= 8 ? '高' : '普通'
            })  
            // this.data.trait[y].standardScore = r;
            // this.data.trait[y].levelCN = r <= 3 ? '低' : r >= 8 ? '高' : '普通';            
            continue;
          }
          if (level[r].length == 2 && score >= level[r][0] && score <= level[r][1]){
            this.setData({
              [standardScore]: r,
              [levelCN]: r <= 3 ? '低' : r >= 8 ? '高' : '普通'
            })      
            // this.data.trait[y].standardScore = r;
            // this.data.trait[y].levelCN = r <=3 ? '低' : r>=8 ? '高' : '普通';
            continue;
          }
        }
      }

      console.log(this.data.trait)
    }
  },
  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
  },
  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
    
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
    
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
    
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
    
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    
  },
  addScore: function (index, num){
    var trait = this.data.trait;
    for (var k in trait) {
      //查询是得分在第几人格
      var questionNum = trait[k].questionNum;
      for (var j = 0; j < questionNum.length; j++) {
        if (index == questionNum[j]) {
          var score = `trait.${k}.score`
          this.setData({
            [score]: this.data.trait[k].score + num
          })
          continue;
        }
      }
    }
  },
  levelCNcolor(text){
    console.log(text);
    return 'red';
  }
})